Revit 2020 API
Edge Methods
The Edge type exposes the following members.
Methods
Name | Description
AsCurve
Returns a curve that corresponds to the edge's parametric orientation.
AsCurveFollowingFace
Returns a curve that corresponds to this edge as oriented in its topological direction on the specified face.
ComputeDerivatives
Returns the vectors describing the edge at the specified parameter.
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
 Determines whether the specified Object is equal to the current Object.
 (Inherited from GeometryObject.)
Evaluate
Evaluates a parameter on the edge.
EvaluateOnFace
Evaluates a parameter on the edge to produce UV coordinates on the face.
GetEndPointReference
Returns a stable reference to the start or the end point of the edge.
GetFace
Returns one of the two faces that meet at the edge.
GetHashCode
 Gets the integer value of the geometry object as hash code
 (Inherited from GeometryObject.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Tessellate
Returns a polyline approximation to the edge.
TessellateOnFace
Returns a polyline approximation to the edge in UV parameters of the face.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
Edge Class
Autodesk.Revit.DB Namespace